Revit 2027 API
ParameterTypeId.PropertySegmentRadius Property
 "Radius"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PropertySegmentRadius { get; }
Public Shared ReadOnly Property PropertySegmentRadius As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PropertySegmentRadius {
	ForgeTypeId^ get ();
}
static member PropertySegmentRadius : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace